s = """העניין הוא שזה לא נעים ומסורבל (ערכית) לשנות את הסדרים בכל מיני דברים שמשפיעים על אנשים אחרים.
אז אני יכול להגיד טוסטר / מקרוגל כשר וכלים שאפשר לחמם בו, (לא יודע גם מה הנורמה לגבי חימום פלסטיק בכללי בקומה), לגבי שירת נשים חיה, יחוד, נטלה לא שבורה. לגבי ימי/שעות למידה בישיבה, פרוטוקול להבדיל בין צלצול חירום שצריך לענות מייד, וסתם שיחות טל' שאפשר גם לנהל מחוץ לשעות העבודה, ותאמת אני לא יודע מה עוד אולי יכול להיות רלוונטי.

אבל, הדבר האחרון שאני רוצה זה שפתאום ישתנו הדברים או קל וחומר יווצרו הגבלות אצל אנשים לא קשורים (במיוחד בשביל הבחור החדש שעוד לא עשה כלום), כאשר יש אלטרנטיבה כל כך פשוטה ודיסקרטית כמו לאכול לחם קפוא עם קוטג במקום גבנצ. במיוחד כשמדובר על נושא כה אישי ולפעמים בלתי יציב כמו חוויה דתית. (למרות שלגבי השיחות טל' אין פתרון אוטומטי פשוט, אבל התשובה שנתת מספיקה לבינתיים).

אני לא חושב שזה נשמע כמו איזה אלטרואיזם, כי זה בחלק גדול לפחות, אינטרס אישי. למשל בעוד דןגמא שהרב הביא היום בהרצאה, על בילויים.
נגיד ביום כיף שרוצים לתכנן, לא יןדע לגבי צור, אבל לצורך העניין, אם כולם היו רוצים ללכת למקום לא כשר או לא מתאים, אני "אסבול" יותר אם בגללי ישנו את התכנית, מאשר אם אתמןדד עם זה באופן אישי, גם עם הקרבה כלשהי על חלק מהכיף שביום כיף.

אני יודע שאפשר לפנות אליך ואני ופניתי ואפנה, אבל אני מודע לזה שאתה אחרי ל 7 אנשים נוספים, לא כולל אותך. ובסופו של דבר אני הןא זה שעושה את השיקול האם להטריח אותך (כמו לכתוב הודעה בכזה אורך 😅, נגיד שזה יחסוך זמן מחר, ושאני כותב טוב יותר משאני מדבר). אז כן, אני כן, לגבי היום המצב היה שונה ש"לא הייתה זכות להקל". וכן אקח את זה לבקורת יותר לתכנן מראש. אבל גם בזה, להגיד מראש על כל מקרה שיכולה להיות בעיה, אני לא יכול."""

print(s.split().__len__())
print(len(s))